temp.html

<?xml version="1.0" encoding="UTF-8"?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap-env:Body xmlns:jns0='http://backend.com/wsdl'>
        <jns0:addOrUpdateTreePart>
            <arg0>
                <active></active>
                <finished></finished>
                <id>0</id>
                <marker>
                    <htmlId>1</htmlId>
                    <id>2</id>
                    <name>asaddas</name>
                    <position>
                        <latitude>47.07040511322995</latitude>
                        <longitude>15.443349480639199</longitude>
                    </position>
                    <type>INFO</type>
                    <version>0</version>
                </marker>
                <questInstanceId>0</questInstanceId>
                <successors>
                    <active>false</active>
                    <finished>false</finished>
                    <id>3</id>
                    <marker>
                        <htmlId>3</htmlId>
                        <id>1</id>
                        <name>asdas</name>
                        <position>
                            <latitude>47.07164</latitude>
                            <longitude>15.444572</longitude>
                        </position>
                        <type>QUIZ</type>
                        <version>0</version>
                    </marker>
                    <questInstanceId>0</questInstanceId>
                    <type>Marker</type>
                    <version>0</version>
                </successors>
                <type>Marker</type>
                <version>0</version>
            </arg0>
        </jns0:addOrUpdateTreePart>
    </soap-env:Body>
</soap-env:Envelope>